%--------------------------------------------------------------------------
%   kalmusÂË²¨Æ÷
%   20180419
%   ÁõÏÄ
%   qwe14789cn@gmail.com
%--------------------------------------------------------------------------
%   function H = kalmus_filter(N,order)
%   N       ÂË²¨Æ÷Êä³öµãÊı
%   order   ÂË²¨Æ÷½×Êı
%--------------------------------------------------------------------------
function H = kalmus_filter(N,order)
fc = linspace(-0.5,0.5,N);
H1 = sin( pi*order*(fc - 1/2/order) ) ./ (pi*(fc - 1/2/order));
H2 = sin( pi*order*(fc + 1/2/order) ) ./ (pi*(fc + 1/2/order));
H =abs(H1-H2)';
end
